<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Introduction" data-toc-modified-id="Introduction-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Introduction</a></span></li><li><span><a href="#Installation" data-toc-modified-id="Installation-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Installation</a></span></li><li><span><a href="#Introduction-to-pandas-data-structures" data-toc-modified-id="Introduction-to-pandas-data-structures-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Introduction to pandas data structures</a></span><ul class="toc-item"><li><span><a href="#Series" data-toc-modified-id="Series-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Series</a></span></li><li><span><a href="#Find-NaN-values" data-toc-modified-id="Find-NaN-values-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Find NaN values</a></span></li></ul></li><li><span><a href="#Read/write-data" data-toc-modified-id="Read/write-data-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Read/write data</a></span><ul class="toc-item"><li><span><a href="#We-load-data-in-CSV-format" data-toc-modified-id="We-load-data-in-CSV-format-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>We load data in CSV format</a></span></li><li><span><a href="#We-load-data-in-xlsx-format" data-toc-modified-id="We-load-data-in-xlsx-format-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>We load data in xlsx format</a></span></li><li><span><a href="#We-display-the-first-rows" data-toc-modified-id="We-display-the-first-rows-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>We display the first rows</a></span></li><li><span><a href="#We-display-the-last-rows" data-toc-modified-id="We-display-the-last-rows-4.4"><span class="toc-item-num">4.4&nbsp;&nbsp;</span>We display the last rows</a></span></li><li><span><a href="#Visualize-a-random-sample" data-toc-modified-id="Visualize-a-random-sample-4.5"><span class="toc-item-num">4.5&nbsp;&nbsp;</span>Visualize a random sample</a></span></li></ul></li><li><span><a href="#Exploratory-analysis-of-a-dataframe" data-toc-modified-id="Exploratory-analysis-of-a-dataframe-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Exploratory analysis of a dataframe</a></span></li><li><span><a href="#Basic-operations-with-dataframes" data-toc-modified-id="Basic-operations-with-dataframes-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Basic operations with dataframes</a></span><ul class="toc-item"><li><span><a href="#We-select-a-column" data-toc-modified-id="We-select-a-column-6.1"><span class="toc-item-num">6.1&nbsp;&nbsp;</span>We select a column</a></span></li><li><span><a href="#We-select-several-columns" data-toc-modified-id="We-select-several-columns-6.2"><span class="toc-item-num">6.2&nbsp;&nbsp;</span>We select several columns</a></span></li><li><span><a href="#Get-the-unique-values-​​of-a-column-(ie-a-Series)" data-toc-modified-id="Get-the-unique-values-​​of-a-column-(ie-a-Series)-6.3"><span class="toc-item-num">6.3&nbsp;&nbsp;</span>Get the unique values ​​of a column (ie a Series)</a></span></li><li><span><a href="#Change-the-data-type-of-a-column" data-toc-modified-id="Change-the-data-type-of-a-column-6.4"><span class="toc-item-num">6.4&nbsp;&nbsp;</span>Change the data type of a column</a></span></li><li><span><a href="#We-filter-the-data-by-the-value-of-the-columns" data-toc-modified-id="We-filter-the-data-by-the-value-of-the-columns-6.5"><span class="toc-item-num">6.5&nbsp;&nbsp;</span>We filter the data by the value of the columns</a></span></li><li><span><a href="#Copy-a-dataframe-and-rename-columns" data-toc-modified-id="Copy-a-dataframe-and-rename-columns-6.6"><span class="toc-item-num">6.6&nbsp;&nbsp;</span>Copy a dataframe and rename columns</a></span><ul class="toc-item"><li><span><a href="#Rename-columns" data-toc-modified-id="Rename-columns-6.6.1"><span class="toc-item-num">6.6.1&nbsp;&nbsp;</span>Rename columns</a></span></li><li><span><a href="#We-can-rename-the-columns-by-crushing-the-instance-attribute...-does-this-ring-a-bell?" data-toc-modified-id="We-can-rename-the-columns-by-crushing-the-instance-attribute...-does-this-ring-a-bell?-6.6.2"><span class="toc-item-num">6.6.2&nbsp;&nbsp;</span>We can rename the columns by crushing the instance attribute... does this ring a bell?</a></span></li></ul></li><li><span><a href="#delete-columns" data-toc-modified-id="delete-columns-6.7"><span class="toc-item-num">6.7&nbsp;&nbsp;</span>delete columns</a></span></li><li><span><a href="#delete-rows" data-toc-modified-id="delete-rows-6.8"><span class="toc-item-num">6.8&nbsp;&nbsp;</span>delete rows</a></span></li><li><span><a href="#Reset_index-and-set_index" data-toc-modified-id="Reset_index-and-set_index-6.9"><span class="toc-item-num">6.9&nbsp;&nbsp;</span>Reset_index and set_index</a></span><ul class="toc-item"><li><span><a href="#SET_INDEX" data-toc-modified-id="SET_INDEX-6.9.1"><span class="toc-item-num">6.9.1&nbsp;&nbsp;</span>SET_INDEX</a></span></li></ul></li><li><span><a href="#Operations-between-columns" data-toc-modified-id="Operations-between-columns-6.10"><span class="toc-item-num">6.10&nbsp;&nbsp;</span>Operations between columns</a></span></li></ul></li><li><span><a href="#Apply-!" data-toc-modified-id="Apply-!-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Apply !</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Passing-a-map-or-an-apply" data-toc-modified-id="Passing-a-map-or-an-apply-7.0.1"><span class="toc-item-num">7.0.1&nbsp;&nbsp;</span>Passing a map or an apply</a></span></li><li><span><a href="#Receive:" data-toc-modified-id="Receive:-7.0.2"><span class="toc-item-num">7.0.2&nbsp;&nbsp;</span>Receive:</a></span></li></ul></li></ul></li><li><span><a href="#Df-.loc-&amp;-.iloc" data-toc-modified-id="Df-.loc-&amp;-.iloc-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Df .loc &amp; .iloc</a></span><ul class="toc-item"><li><span><a href="#Select-rows-and-columns-in-Pandas-by-position-with-iloc" data-toc-modified-id="Select-rows-and-columns-in-Pandas-by-position-with-iloc-8.1"><span class="toc-item-num">8.1&nbsp;&nbsp;</span>Select rows and columns in Pandas by position with iloc</a></span></li><li><span><a href="#Select-rows-and-columns-in-Pandas-based-on-labels-with-loc" data-toc-modified-id="Select-rows-and-columns-in-Pandas-based-on-labels-with-loc-8.2"><span class="toc-item-num">8.2&nbsp;&nbsp;</span>Select rows and columns in Pandas based on labels with loc</a></span><ul class="toc-item"><li><span><a href="#Based-on-label" data-toc-modified-id="Based-on-label-8.2.1"><span class="toc-item-num">8.2.1&nbsp;&nbsp;</span>Based on label</a></span></li></ul></li></ul></li><li><span><a href="#Order-a-dataframe" data-toc-modified-id="Order-a-dataframe-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>Order a dataframe</a></span><ul class="toc-item"><li><span><a href="#Look-for-null-values" data-toc-modified-id="Look-for-null-values-9.1"><span class="toc-item-num">9.1&nbsp;&nbsp;</span>Look for null values</a></span><ul class="toc-item"><li><span><a href="#It-is-null?" data-toc-modified-id="It-is-null?-9.1.1"><span class="toc-item-num">9.1.1&nbsp;&nbsp;</span>It is null?</a></span></li><li><span><a href="#Is-NOT-null?" data-toc-modified-id="Is-NOT-null?-9.1.2"><span class="toc-item-num">9.1.2&nbsp;&nbsp;</span>Is NOT null?</a></span></li><li><span><a href="#Sum-the-null-values-​​of-each-column" data-toc-modified-id="Sum-the-null-values-​​of-each-column-9.1.3"><span class="toc-item-num">9.1.3&nbsp;&nbsp;</span>Sum the null values ​​of each column</a></span></li></ul></li><li><span><a href="#delete-null-values" data-toc-modified-id="delete-null-values-9.2"><span class="toc-item-num">9.2&nbsp;&nbsp;</span>delete null values</a></span></li><li><span><a href="#How-to-fill-in-the-missing-data" data-toc-modified-id="How-to-fill-in-the-missing-data-9.3"><span class="toc-item-num">9.3&nbsp;&nbsp;</span>How to fill in the missing data</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#CATEGORIES-IN-DATAFRAME:-DOCUMENTATION" data-toc-modified-id="CATEGORIES-IN-DATAFRAME:-DOCUMENTATION-9.3.0.1"><span class="toc-item-num">9.3.0.1&nbsp;&nbsp;</span>CATEGORIES IN DATAFRAME: DOCUMENTATION</a></span></li></ul></li></ul></li></ul></li><li><span><a href="#We-delete-the-duplicates" data-toc-modified-id="We-delete-the-duplicates-10"><span class="toc-item-num">10&nbsp;&nbsp;</span>We delete the duplicates</a></span></li><li><span><a href="#Data-aggregation" data-toc-modified-id="Data-aggregation-11"><span class="toc-item-num">11&nbsp;&nbsp;</span>Data aggregation</a></span><ul class="toc-item"><li><span><a href="#GroupBy-&amp;-pivot_table" data-toc-modified-id="GroupBy-&amp;-pivot_table-11.1"><span class="toc-item-num">11.1&nbsp;&nbsp;</span>GroupBy &amp; pivot_table</a></span></li><li><span><a href="#Union-of-Dataframes" data-toc-modified-id="Union-of-Dataframes-11.2"><span class="toc-item-num">11.2&nbsp;&nbsp;</span>Union of Dataframes</a></span></li><li><span><a href="#Concat" data-toc-modified-id="Concat-11.3"><span class="toc-item-num">11.3&nbsp;&nbsp;</span>Concat</a></span><ul class="toc-item"><li><span><a href="#Concatenating-on-axis-0-(rows)" data-toc-modified-id="Concatenating-on-axis-0-(rows)-11.3.1"><span class="toc-item-num">11.3.1&nbsp;&nbsp;</span>Concatenating on axis 0 (rows)</a></span></li><li><span><a href="#Concatenating-on-axis-1-(columns)" data-toc-modified-id="Concatenating-on-axis-1-(columns)-11.3.2"><span class="toc-item-num">11.3.2&nbsp;&nbsp;</span>Concatenating on axis 1 (columns)</a></span></li></ul></li><li><span><a href="#Merge" data-toc-modified-id="Merge-11.4"><span class="toc-item-num">11.4&nbsp;&nbsp;</span>Merge</a></span><ul class="toc-item"><li><span><a href="#LEFT-Merge" data-toc-modified-id="LEFT-Merge-11.4.1"><span class="toc-item-num">11.4.1&nbsp;&nbsp;</span>LEFT Merge</a></span></li><li><span><a href="#RIGHT-Merge" data-toc-modified-id="RIGHT-Merge-11.4.2"><span class="toc-item-num">11.4.2&nbsp;&nbsp;</span>RIGHT Merge</a></span></li><li><span><a href="#INNER-Merge" data-toc-modified-id="INNER-Merge-11.4.3"><span class="toc-item-num">11.4.3&nbsp;&nbsp;</span>INNER Merge</a></span></li><li><span><a href="#OUTER-Merge" data-toc-modified-id="OUTER-Merge-11.4.4"><span class="toc-item-num">11.4.4&nbsp;&nbsp;</span>OUTER Merge</a></span></li></ul></li><li><span><a href="#Merging-/-Concatenating-in-two-different-columns" data-toc-modified-id="Merging-/-Concatenating-in-two-different-columns-11.5"><span class="toc-item-num">11.5&nbsp;&nbsp;</span>Merging / Concatenating in two different columns</a></span><ul class="toc-item"><li><span><a href="#Concatenating-in-two-different-columns" data-toc-modified-id="Concatenating-in-two-different-columns-11.5.1"><span class="toc-item-num">11.5.1&nbsp;&nbsp;</span>Concatenating in two different columns</a></span></li><li><span><a href="#Merging-in-two-different-columns" data-toc-modified-id="Merging-in-two-different-columns-11.5.2"><span class="toc-item-num">11.5.2&nbsp;&nbsp;</span>Merging in two different columns</a></span></li></ul></li><li><span><a href="#Join" data-toc-modified-id="Join-11.6"><span class="toc-item-num">11.6&nbsp;&nbsp;</span>Join</a></span></li><li><span><a href="#Differences-between-join-&amp;-merge" data-toc-modified-id="Differences-between-join-&amp;-merge-11.7"><span class="toc-item-num">11.7&nbsp;&nbsp;</span>Differences between join &amp; merge</a></span></li></ul></li><li><span><a href="#Export-data" data-toc-modified-id="Export-data-12"><span class="toc-item-num">12&nbsp;&nbsp;</span>Export data</a></span></li><li><span><a href="#Pandas-usual-methods" data-toc-modified-id="Pandas-usual-methods-13"><span class="toc-item-num">13&nbsp;&nbsp;</span>Pandas usual methods</a></span></li><li><span><a href="#Mega-recap" data-toc-modified-id="Mega-recap-14"><span class="toc-item-num">14&nbsp;&nbsp;</span>Mega-recap</a></span></li><li><span><a href="#Further-materials" data-toc-modified-id="Further-materials-15"><span class="toc-item-num">15&nbsp;&nbsp;</span>Further materials</a></span></li></ul></div>

# Pandas

![pandas](https://media.giphy.com/media/nVsLCrW5iHf6E/giphy.gif)

## Introduction
Pandas is undoubtedly the most widely used library in the Python ecosystem for data manipulation and analysis. It's fast, powerful, flexible, easy to use and open source.


Among its main features:

- A fast and efficient **DataFrame** object for data manipulation with built-in indexing* 

- **Reading and writing** of data in many formats: Microsoft Excel, CSV, SQL databases, etc;

- Integrated and efficient methods for all types of data manipulation: missing data, subset, union, merge, etc;

- Ease of working with temporary data (in fact, Pandas is named after "PANnel DAta")

- Good **integration with other data analysis or Machine learning libraries**: scikit-learn, scipy, seaborn, plotly, etc;

- It is **widely used** in both the private and academic sectors


Pandas provides high-level data structures and functions designed to make working with structured or tabular data fast, easy, and expressive. Since its introduction in 2010, it has helped make Python a powerful and productive data analysis environment. The main pandas objects that will be used in this book are the DataFrame, a column-oriented tabular data structure with row and column labels, and the Series, a labeled one-dimensional array object.

Pandas combines the high performance ideas of NumPy with the flexible data manipulation capabilities of spreadsheets and relational databases (such as SQL). It provides sophisticated indexing functionality to make it easy to reshape, slice and dice, perform aggregations, and select subsets of data.

![image](https://thumbor.forbes.com/thumbor/960x0/https%3A%2F%2Fblogs-images.forbes.com%2Fgilpress%2Ffiles%2F2016%2F03%2FTime-1200x511.jpg)



Source: [Forbes](https://www.forbes.com/sites/gilpress/2016/03/23/data-preparation-most-time-consuming-least-enjoyable-data-science-task-survey-says/#1ba071616f63)

## Installation

The first thing you should do will always be
`pip install pandas`, `conda install pandas`

In [ ]:
# anaconda
    # enviroments: ironhack
    #pandas
    
# miniconda
    # conda activate ironhack
    #pip install pandasz

In [ ]:
import pandas as pd

## Introduction to pandas data structures
To get started with pandas, you'll need to get comfortable with its two working data structures: Series and DataFrame. Although they are not a universal solution to all problems, they provide a solid and easy-to-use foundation for most applications.

### Series
A Serie is a one-dimensional array object containing a sequence of values ​​(of NumPy-like types) and an associated array of data labels, called its index. The simplest Series is formed from a single array of data:

In [ ]:
my_serie = pd.Series([1, 2, 3, "a string", 4, 5])
my_serie

In [ ]:
random_list = [1, 2, 3, "a string", 4, 5]
random_list[3]

In [ ]:
type(my_serie)

In [ ]:
my_serie.values

In [ ]:
my_serie.index

The string representation of a Series displayed interactively shows the index on the left and the values ​​on the right. Since we didn't specify an index for the data, a default one consisting of the integers 0 to N - 1 (where N is the length of the data) is created. You can get the array representation and the index object of the Series through its values ​​and index attributes, respectively:

Another way to think of a Series is as a fixed-length ordered dict, since it is a mapping of index values ​​to data values. It can be used in many contexts where a dictionary could be used.
If you have data contained in a Python dict, you can create a Series from it by passing the dict:

In [ ]:
somedata = {
    "Ohio": 20000,
    "Texas": 2020,
    "Oregon":444, 
    "Utah":19019, 
    "Something else": 5959
}

In [ ]:
somedata.keys()

In [ ]:
somedata.values()

In [ ]:
somedata

In [ ]:
my_serie

In [ ]:
somedata_series = pd.Series(somedata)
somedata_series

In [ ]:
states = ["California", "Ohio", "Oregon", "Texas", "Something else"]

In [ ]:
somedata_series = pd.Series(somedata, index = states)
somedata_series

In [ ]:
type(somedata_series["Ohio"])

In [ ]:
type(somedata_series["California"])

In [ ]:
# Exlore an object (a Series) and check how much information you don't have
# How many missing values I have

pd.isnull(somedata_series).sum()

When only one dict is passed, the resulting String index will have the keys of the dict in order. You can override this by passing the keys of the dict in the order you want them to appear in the resulting String:

In [ ]:
somedata_series

In [ ]:
states_2 = ["California", "Ohio", "Texas", "Oregon"] #Oregon to the end

In [ ]:
somedata_series_2 = pd.Series(somedata, index=states)
somedata_series_2

Here, the three values ​​found in sdata were placed in the appropriate places, but since no value was found for 'California', it appears as NaN (not a number), which is considered in pandas to mark missing values ​​or NA. Since "Utah" was not included in the states, it is excluded from the resulting object.

In [ ]:
somedata_series_2

### Find NaN values
NaN stands for Not A Number and is one of the common ways to represent the missing value in the data. It is a special floating point value and cannot be converted to a type other than float.
The NaN value is one of the main problems in data analysis. It is very essential to deal with NaN to get the desired results.

In [ ]:
#NaN: NotaNumber -> float
#NaN: missing values

In [ ]:
pd.isnull(somedata_series)

In [ ]:
pd.isna(somedata_series)

## Read/write data

Pandas can read and write data from a wide variety of formats. [Read the documentation](https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html)
Although one of the most common is from a dict of lists of equal length or NumPy arrays:

In [ ]:
import numpy as np

In [ ]:
data = {
    "state": ["Ohio", "texas", "nevada", "michigan"],
    "year": [1990, 2000, 2001, 2005],
    "something": [1.5, "sds", 2223, np.nan]
}

In [ ]:
df = pd.DataFrame(data)
df

In [ ]:
#display(df)

If I create a dataframe through a list of dictionaries:
- Each dictionary will be a row
- The keys will be the names of the columns
- They have to have the same structure

In [ ]:
df = pd.read_csv("../datasets/Advertising.csv")
df

In [ ]:
# sep=';'

Since we are using Jupyter Notebook, pandas DataFrame objects will be displayed as a more browser-friendly HTML table. [More info on this](https://pandas.pydata.org/pandas-docs/stable/user_guide/options.html)

### We load data in CSV format

In [ ]:
# CSV: comma separated values

### We load data in xlsx format

In [ ]:
# xlsx
! ls ../datasets/Online Retail.xlsx

In [ ]:
#df_from_excel = pd.read_excel("../datasets/Online Retail.xlsx")
#df_from_excel

In [ ]:
read_csv
read_sql
read_xlsx


# export
pd.to_csv

### We display the first rows

By default head shows me the first 5 rows, I can see some more or less by passing a number as a parameter

In [ ]:
# bash file head -2ç
# bash file tail -10

In [ ]:
df.head(3)

### We display the last rows

In [ ]:
df.tail()

In [ ]:
display(df)

Exactly the same as with .head() we pass a parameter to .tail()

### Visualize a random sample

In [ ]:
df.sample()

In [ ]:
df.sample(frac=0.8)

## Exploratory analysis of a dataframe

In [ ]:
df.info()

In [ ]:
df.describe()

In [ ]:
df["Sales"].value_counts()

In [ ]:
df.sample()

In [ ]:
df.shape

In [ ]:
list(df.columns)

In [ ]:
df["TV"].max()

In [ ]:
#arr_1.mean()
df["TV"].mean()

In [ ]:
df["Sales"].sum()# as if it was a dictionary

In [ ]:
df.Sales.sum() #as the attribute

In [ ]:
# If we have special characters -> we use df["Special CharacterS!"]

## Basic operations with dataframes

### We select a column

In [ ]:
df["Sales"]

In [ ]:
df.sample()

### We select several columns

In [ ]:
# Subset of a dataframe
# By passing a list of columns to the df
df_2 = df[["Sales", "TV"]]
df_2

In [ ]:
path = "../datasets/Advertising.csv"
df_ads = pd.read_csv(path)
df_ads

In [ ]:
df_2 = df[["TV", "Sales"]]
df_2.sample()

In [ ]:
#Exporting
df_2.to_csv("../datasets/dummy.csv")

### Get the unique values ​​of a column (ie a Series)

In [ ]:
df_3 = pd.read_csv("../datasets/avocado_kaggle.csv")
df_3

In [ ]:
df_3["region"].unique()

In [ ]:
df_3.region.unique()

In [ ]:
df_3.type.value_counts()

# RECAP

- pandas is a library
- helps oprganize data
    - tabular data: rows & columns
    - dataframes: 2D arrays
    - dataframes & series
        - series: 1D arrays: values and index
        - just like a dictionary has keys and values
        - dataframe is an object that is the whole table
- we can preview
    - df.sample()
    - df.head() and df.tail()
    - df.info(), df.describe(), df.dtypes
    
    - df.column.value_counts()
    - df.column.unique()
    
    - Operations: sum, max, min, mean, std, 
    
- subsets: just some columns
- read and export from csv files: changes in jupyter notebook do not change the actual file in your computer
- check null values
    - type(NaN): float
    - NaN: missing value

In [ ]:
df_3.columns

In [ ]:
#df_3["type"]
df_3.type.value_counts()

In [ ]:
df_3.type.unique()

In [ ]:
condition = df_3["type"] == "conventional"
# [True, False, False, False, True]
df_3_conventional = df_3[condition]
df_3_conventional.head()

In [ ]:
#an array is X long

array= np.array((7,3))
array

In [ ]:
df_3_conventional.size

In [ ]:
# Which one is more efficient?

In [ ]:
class DataFrame ():
    
    def __init__ (self, rows):
        self.rows = rows #attributes, showing
        
    def count (): # methods, doing
        counter = 0 
        for row in DataFrame:
            counter += row   
        return counter

In [ ]:
rows = df_3_conventional.shape[0]
rows#whole df

In [ ]:
df_3_conventional.count()

In [ ]:
#df_3_conventional["type"]
df_3_conventional.type

In [ ]:
# My first filter

boston_condition = df_3["region"] == "Boston"

boston_dataset = df_3[boston_condition]
boston_dataset

In [ ]:
boston_dataset.region.unique()

In [ ]:
df_3.region.unique()

### Change the data type of a column

In [ ]:
df.sample()

In [ ]:
df.info()

In [ ]:
# float -> int

In [ ]:
df["Sales"] = df["Sales"].astype("int")
df["Sales"]

In [ ]:
df["Sales"]
# apply a function to an iterable -> map
    # for every element in the iterable, passing a function
        # element -> int(element)
        
# map -> different in pandas

In [ ]:
df.sample()

### We filter the data by the value of the columns

In [ ]:
df_3.sample()

In [ ]:
# same thing BUT applying two filters at once
# type == conventional
# average price < 1

In [ ]:
df_3.AveragePrice[0]

In [ ]:
df_3.AveragePrice[0] < 1

In [ ]:
condition_1 = (df_3["type"] == "conventional") #boolean
condition_2 = (df_3.AveragePrice < 1)

In [ ]:
df_3_filtered = df_3[(df_3["type"] == "conventional") & (df_3["AveragePrice"] < 1)]
#df_3_filtered = df_3[condition_1 & condition_2]

df_3_filtered

In [ ]:
#df["AveragePrice"] # KeyError: 'AveragePrice'

a_dictionary = {
    "age": 30
}
 
# a_dictionary["location"] # KeyError: 'location'

In [ ]:
# Delete the column & reference it later
# Mispell the column (or try it has spaces and you're doing .notation)
# You just don't have it

In [ ]:
# conventional
# and avgprice < 1 OR above 5

condition_1 = (df_3["type"] == "conventional")
condition_2 = (df_3["AveragePrice"] < 1)
condition_3 = (df_3["AveragePrice"] > 1.8) 
# leaving a range: 1-1.8 OUT


df_4_filtered = df_3[condition_1 & (condition_2 | condition_3)] # for sanity, use brackets
#df_4_filtered = df_3[condition_1 & condition_2 | condition_3]

df_4_filtered

In [ ]:
df_3.sample()

In [ ]:
df_3["type"].value_counts()

In [ ]:
# 1. type = conventional

# 2. avgeprice < 1
# 3.totl bags > 100000

In [ ]:
list(df_3.columns)[7]

In [ ]:
condition_1 = (df_3["type"] == "organic")
condition_2 = (df_3["AveragePrice"] < 1)
condition_3 = (df_3["4770"] > 100.0)

In [ ]:
# filtering from two columns: ok
# from different different tables: you'd ahve to merge first

In [ ]:
df_3_filtered_again_2 = df_3[condition_1 & ((df_3["AveragePrice"] < 1) | (df_3["4770"] > 100.0))]
df_3_filtered_again_2

In [ ]:
# Fastest way to check ranges of values within columns
df_3["AveragePrice"].describe()

In [ ]:
df_4_filtered["AveragePrice"].describe() # 1-1.8

In [ ]:
condition = df_3["type"] == "organic"
df_3_2 = df_3[condition]
df_3_2

### Copy a dataframe and rename columns

In [ ]:
a_new_copy = df.copy()
a_new_copy

#### Rename columns
To rename columns we need a dictionary

In [ ]:
list(df_3.columns)

In [ ]:
# 'Total Volume',
# "total_volume"
# 'Large Bags', -> "large"

In [ ]:
# make copies: df_new = df
# export frequently
# have the some code:
    # re-run

In [ ]:
# removing spaces:
    # strip spaces left and right
    # replace other spaces -> _
# lowercase

In [ ]:
df_3.sample()

In [ ]:
list(df_3.columns)
# for loop
# map

In [ ]:
for column in list(df_3.columns):
    print(column.lower().strip().replace(" ", "_").replace(":", ""))

In [ ]:
my_columns_renamed = {column : column.lower().strip().replace(" ", "_").replace(":", "") for column in df_3.columns}
my_columns_renamed

In [ ]:
df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})
df.rename(columns={"A": "a", "B": "c"})

In [ ]:
# Specifying axis when not using columns = {}
df_3.rename(my_columns_renamed, axis='columns', inplace=False)

In [ ]:
df_3.rename(columns = my_columns_renamed, inplace=True)
# error
# no error

The rename method allows me to rename only the columns that I want, the ones that are in the dictionary. No need to rename all at once

In [ ]:
df_3.rename(columns = {"averageprice": "average_price"}, inplace=True)

In [ ]:
df_3

#### We can rename the columns by crushing the instance attribute... does this ring a bell?
Requires a list with the same number of columns

In [ ]:
list(df_3.columns)

In [ ]:
df_3.columns = ['unnamed_0',
 'this one is changed',
 'average_price',
 'total_volume',
 '4046',
 '4225',
 '4770',
 'total_bags',
 'small_bags',
 'large_bags',
 'xlarge_bags',
 'type',
 'year',
 'region']

In [ ]:
df_3

### delete columns

In [ ]:
df_3.to_csv("./example_unnamed_1.csv")

In [ ]:
df_3_unnamed_1 = pd.read_csv("./example_unnamed_1.csv")
df_3_unnamed_1

In [ ]:
df_3.to_csv("./example_unnamed_2.csv", index = False)
df_3_unnamed_2 = pd.read_csv("./example_unnamed_2.csv")
df_3_unnamed_2

In [ ]:
new_df = df_3_unnamed_2.drop(["unnamed_0"], axis = 1)
new_df
# AXIS 1 = COLUMNS
# AXIS 0 = Rows

In [ ]:
new_df_2 = df_3_unnamed_2.drop(["4046"], axis = 1) # inplace = True
new_df_2

In [ ]:
df_3_unnamed_2.head()

In [ ]:
# np.where 
# (array > 100, 255, 0)
# identify and drop

### delete rows

In [ ]:
df_3_unnamed_2.drop([1, 2], axis = 0, inplace=True) # inplace = True

In [ ]:
df_3_unnamed_2.drop([3, 4], axis = 0, inplace = True) # inplace = True

In [ ]:
df_3_unnamed_2

Rows can also be deleted. Note that the indexes are not reset. The index is associated with the row, not the order.
Can the index be restarted? Correct

### Reset_index and set_index

We read the [documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.reset_index.html) to understand some parameters

#### SET_INDEX

In [ ]:
df_3.reset_index()

What can we use to have the date as an index?
We will see it later, to analyze temporary series

In [ ]:
df_3.set_index("year", inplace=True)

In [ ]:
df_3.columns

In [ ]:
import seaborn as sns
sns.set_context("poster")
sns.set(rc={'figure.figsize': (20.,6.)})
sns.set_style('whitegrid')

In [ ]:
df_3.set_index("this one is changed", inplace=True)

In [ ]:
sns.lineplot(data = df_3, x = df_3.index, y=df_3["average_price"])

In [ ]:
list(df_3.columns)

In [ ]:
condition = df_3["type"] == "organic"
df_3_2 = df_3[condition]
df_3_2

### Operations between columns

In [ ]:
df_3["small & large"] = df_3["small_bags"] + df_3["large_bags"]
df_3

In [ ]:
# Q Carles & Carlos: new columns to be set in the order you want
# A: create a subset altering the order you want

In [ ]:
df_100 = pd.read_csv("../datasets/avocado_kaggle.csv")

In [ ]:
list(df_100.columns)

In [ ]:
# Subset
df_100 = df_100[[
 'Date',
 'AveragePrice',
 'Total Volume',
 '4046',
 '4225',
 '4770',
 'Total Bags',
 'Small Bags',
 'Large Bags',
 'XLarge Bags',
 'type',
 'year',
 'region',
'Unnamed: 0']]

df_100.sample()

In [ ]:
df_100.head(3)

## Apply !

In [ ]:
#map(function, iterable)

In [ ]:
df_100["type"][3]

In [ ]:
df["type"]

In [ ]:
#Q: Apply just passing the function

df_100["type"] = df_100["type"].apply(upper)

In [ ]:
#Q: Apply just passing the function but with parentheses

df_100["type"] = df_100["type"].apply(upper())

In [ ]:
def letter_for_letter (n):
    x = n.replace("C", "x")
    return x

In [ ]:
letter_for_letter ("CkCjbnCihs")

In [ ]:
df_100["new"] = df_100["new"].apply(letter_for_letter)
df_100.sample()

In [ ]:
df_100["new"] = df_100["type"].apply(lambda x: x.upper())
df_100.sample()

In [ ]:
# 1. Define a function yourself and just pass it
# 2. You use lambda x: x.replace(" ", "").strip()
    # 3. lambda x: int(x) -> float to int astype(int)

In [ ]:
df_100["AveragePrice"] = df_100["AveragePrice"].apply(lambda x: int(x))
df_100.sample()

Applies a function along an axis of the DataFrame.
[Read the docs](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html)

When I do an apply on a column, even though I use a lambda, I don't put axis because in the case below, what I'm doing is modifying a column, I use lambda to tell the apply that the first argument is a string that comes from outside and the second argument is the dataframe's own record.

The same way map receives a function and something it iteraves over
A DF is composed of numpy.arrays. So it's an iterable


#### Passing a map or an apply
- map -> function, iterable
- apply -> function, iterable


#### Receive:

- apply & user-defined function -> apply(function) "x", a value
- apply & lambda -> lambda row: row["column"]

In [ ]:
df_100.head(1)

In [ ]:
df_100.loc[0]["Total Volume"]

In [ ]:
# Applying to the whole DF -> one argument
df_100["new_column_condition"] = df_100.apply(lambda x: x["region"] if x["region"].startswith("A") else "doesnt with A", axis=1)

In [ ]:
df_100.sample()

In [ ]:
# Applying to the whole DF -> using two things of tha one argument
df_100["new_column_condition"] = df_100.apply(lambda x: x["region"] if x["year"] > 2015 else "previous", axis=1)

In [ ]:
df_100.sample()

In [ ]:
# Pass a function to a lambda

def return_werid_things (n, x):
    if n.startswith("A"):
        return n
    return x

In [ ]:
return_werid_things ("Albany", "Not an A")

In [ ]:
df_100["new_weird_column"] = df_100["region"].apply(lambda x: (return_werid_things(x, "Not an A")))

In [ ]:
df_100.sample()

In [ ]:
# Apply to a series
    # user-defined 
    # lambda
        # built-in
# Apply to the whole dataframe
    # the same
    
# Include lambdas & functions

## Df .loc & .iloc

### Select rows and columns in Pandas by position with iloc

loc syntax with multiple conditions
```python
df.loc[(df["column"] condition) & (df["column"] condition)]
````

The iloc method is used on DataFrames to select elements based on their location. Its syntax is data.iloc[<filas>, <columnas>], where <filas> and <columnas> are the position of the rows and columns that you want to select in the order that they appear in the object. A familiar notation for Matlab users. In a DataFrame, each of the rows has a number that goes from 0 to the total number of rows minus one. Being iloc the method that allows selecting the data based on these numbers. The same applies to columns.

In iloc there are two arguments rows and columns. In case the second is omitted, all columns in the row will be selected. So to select different rows can be used.

### Select rows and columns in Pandas based on labels with loc
The loc method can be used in two different ways: select rows or columns based on a label, or select rows or columns based on a condition.

In [ ]:
df_100.sample()

In [ ]:
df_series_random = df_100.loc[16095]

In [ ]:
df_series_random

In [ ]:
df_100[5:10]

#### Based on label

In [ ]:
df_100.loc[df_100["region"] == "California"]

In [ ]:
df_100.loc[5045]

## Order a dataframe

In [ ]:
df_100.head(5)

In [ ]:
df_100.sort_values(by="Total Volume", ascending=True).head(5)

Same operation, but give me only concrete columns

In [ ]:
df_100_new = df_100.loc[(df_100["year"] > 2016) & (df_100["region"] != "Albany")]
df_100_new.sample()

### Look for null values

In [ ]:
import seaborn as sns
df_titanic = sns.load_dataset("titanic")
df_titanic

In [ ]:
df_titanic.info()

In [ ]:
df_titanic.describe()

#### It is null?

`pd.isna()` == `pd.isnull()`

In [ ]:
df_titanic.isnull()

In [ ]:
df_titanic.isna()

#### Is NOT null?

In [ ]:
df_titanic.notnull().sum()

#### Sum the null values ​​of each column

In [ ]:
df_titanic.isna().sum()

### delete null values
There are several ways to do this, we take into account the "how" parameter and of course [the docs](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html).

In [ ]:
df_t_copy = df_titanic.copy()
df_t_copy

In [ ]:
df_t_copy

REMEMBER THAT INPLACE TRUE IS FOR THE METHOD TO ACTION ON THE DF, IF NOT, I HAVE TO SAVE IT IN A NEW VARIABLE

With "any" (parameter that comes by default so be careful not to put anything) all the records in which there is a NaN in any column are deleted

In [ ]:
# Nans: how many

    # how: any, all
    # thresh: exclusive with how
    
#https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.dropna.html?highlight=dropna#pandas.DataFrame.dropna

In [ ]:
df_t_copy.dropna(axis=0, inplace=True, how="all")
df_t_copy.dropna(axis=0, inplace=True, how="any") #ONE VALUE IS MISSING, DROP THE WHOLE THING


# drop the rows where at least ANY value missing value
# drop where EVERY value in that row is missing

In [ ]:
#Dropping missing values where there's ANY

df_t_copy_any = df_titanic.copy()

df_t_copy_any.dropna(axis=0, inplace=True, how="any")
df_t_copy_any.shape

In [ ]:
#Dropping missing values where there's ALL

df_t_copy_all = df_titanic.copy()

df_t_copy_all.dropna(axis=0, inplace=True, how="all")
df_t_copy_all.shape

In [ ]:
df_titanic.isna().sum()

In [ ]:
#Q Marc Planas: SUSBSET: missing values in both columns
df_t_copy_subset = df_titanic.copy()

df_t_copy_subset.dropna(axis=0, inplace=True, how="all", subset=["age", "deck"])
df_t_copy_subset.shape

In [ ]:
#Q Marc Planas: SUSBSET: missing values in a given column
df_t_copy_subset = df_titanic.copy()

df_t_copy_subset.dropna(axis=0, inplace=True, how="all", subset=["age", "deck", "embark_town", "embarked"])
df_t_copy_subset.shape

In [ ]:
#Q Marc Planas: SUSBSET: missing values in a given column
df_t_copy_subset = df_titanic.copy()

df_t_copy_subset.dropna(axis=0, inplace=True, how="any", subset=["embark_town", "embarked"])
df_t_copy_subset.shape

In [ ]:
print(list(df_titanic.columns))

In [ ]:
subset_titanic = df_titanic[['pclass',
 'sex',
 'age',
 'sibsp',
 'parch',
 'fare',
 'embarked',
 'class',
 'who',
 'adult_male',
 'deck',
 'embark_town',
 'alive',
 'alone']]

subset_titanic.sample()

In [ ]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [ ]:
df.dropna(thresh=2)

In [ ]:
# Thresh: number of values not empty
df_t_copy_thresh = df_titanic.copy()
df_t_copy_thresh.isna().sum()

In [ ]:
df_t_copy_thresh.dropna(axis=0, inplace=True, thresh=15) #Set it to 13, 14 & 15
df_t_copy_thresh.shape

In [ ]:
df_t_copy_thresh.isna().sum()

In [ ]:
df_t_copy.shape

In [ ]:
df_titanic.shape

### How to fill in the missing data

How about a little [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.fillna.html)?

In [ ]:
df_titanic_age = df_titanic.copy()
df_titanic_age.sample()

In [ ]:
df_titanic_age.isna().sum()

In [ ]:
mean_age = df_titanic_age["age"].mean()
mean_age

In [ ]:
# generate random numbers in a given range

In [ ]:
df_titanic_age["age"].fillna(mean_age, inplace=True)

In [ ]:
df_titanic_age["age"].mean()

In [ ]:
df_titanic_age.isna().sum()

##### CATEGORIES IN DATAFRAME: DOCUMENTATION
https://runebook.dev/en/docs/pandas/user_guide/categorical

## We delete the duplicates

[Read the docs](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.duplicated.html)

In [ ]:
df_titanic.duplicated().sum()

In [ ]:
df_titanic.drop_duplicates()

In [ ]:
df_titanic.shape

In [ ]:
# You want BOTH entries where it has been duplicated

In [ ]:
df_titanic.drop_duplicates(inplace=True, keep=False)
df_titanic.shape

## Data aggregation
### GroupBy & pivot_table
Pandas GroupBy is a powerful and versatile function in Python. It allows us to split your data into separate groups to perform calculations for better analysis.
A DataFrame can be grouped on its rows (axis=0) or on its columns (axis=1). Once this is done, a function is applied to each group, producing a new value. Finally, the results of all those function applications are combined into a result object. The shape of the resulting object will usually depend on what is done with the data.

In [ ]:
df_100.sample()

In [ ]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'], 
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

`CUANTITATIVE.groupby(CATEGORICAL).calculation()`

In [ ]:
df["data1"].groupby(df["key1"]).mean()

In [ ]:
df["data1"].groupby(df["key1"]).count()

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html

Another way to groupby with agg syntax
https://pandas.pydata.org/docs/reference/api/pandas.core.groupby.DataFrameGroupBy.aggregate.html

- mean
- sum
-count

In [ ]:
df.groupby("key1").agg({"data1":"mean", "data2":"sum"})

Suppose we want to calculate the mean of column data1 using the labels of key1. There are several ways to do it. One is to access data1 and call groupby with the column (a String) in key1.
The data (a Series) has been aggregated based on the group key, producing a new String that is now indexed by the unique values ​​of the key1 column. The resulting index has the name 'key1' because the DataFrame column `df['key1']` did.

# RECAP

- Exploratory Data analysis - EDA
    - Knowing what it is you have: qty, data structure, missing values
    - Understand the domain of what you have
    - Descriptive statistics of everything: idea
- Cleaning
    - easy to work with
    - standarized somehow: same
        - man, woman, Women, a man -> man / women
    - cities -> states
        - Albany, Springfield -> grouping into states
    - strings
    - handling missing values / Nan
        - drop, input, ignore
- create new columns
- include more info: adding dataframes together
- visualize
- up to you and to the task
- csv, jsons and sql

### Union of Dataframes
- https://realpython.com/pandas-merge-join-and-concat/
- https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html


### Concat
We join dataframes along axis 0 one below the other. Align columns by label.

In [485]:
df = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',
                             sep='|', 
                             index_col='user_id')

In [490]:
df.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [500]:
first_df.head(5) #needs to be an int

         age gender     occupation zip_code
user_id
396       57      M       engineer    94551
868       21      M     programmer    55303
170       53      F     healthcare    30067
665       25      M  administrator    55412
734       25      F          other    63108

In [515]:
first_df = df.sample(frac=0.01)
second_df = df.sample(frac=0.01)

In [521]:
first_df
#first_df.shape

         age gender     occupation zip_code
user_id
716       36      F  administrator    44265
914       44      F          other    08105
572       51      M       educator    20003
267       23      M       engineer    83716
290       40      M       engineer    93550
348       24      F        student    45660
467       29      M       engineer    91201
2         53      F          other    94043
702       37      M          other    89104

In [522]:
second_df
#second_df.shape

         age gender  occupation zip_code
user_id
71        39      M   scientist    98034
636       47      M    educator    48043
363       20      M     student    87501
203       25      F     student    32301
17        30      M  programmer    06355
723       26      M   executive    94403
259       21      M     student    48823
366       20      F     student    50670
887       14      F     student    27249

#### Concatenating on axis 0 (rows)

In [525]:
concatenated_axis_zero = pd.concat([first_df, second_df], axis=0, keys=["first", "second"])
concatenated_axis_zero

                age gender     occupation zip_code
       user_id
first  716       36      F  administrator    44265
       914       44      F          other    08105
       572       51      M       educator    20003
       267       23      M       engineer    83716
       290       40      M       engineer    93550
       348       24      F        student    45660
       467       29      M       engineer    91201
       2         53      F          other    94043
       702       37      M          other    89104
second 71        39      M      scientist    98034
       636       47      M       educator    48043
       363       20      M        student    87501
       203       25      F        student    32301
       17        30      M     programmer    06355
       723       26      M      executive    94403
       259       21      M        student    48823
       366       20      F        student    50670
       887       14      F        student    27249

In [524]:
concatenated_axis_zero.shape

(18, 4)

#### Concatenating on axis 1 (columns)

In [527]:
concat_one_one = pd.concat([first_df, second_df], axis=1, keys=["from the 1s", "the 2nd"]) #keys is an optional argument
concat_one_one

        from the 1s                                the 2nd                     \
                age gender     occupation zip_code     age gender  occupation
user_id
716            36.0      F  administrator    44265     NaN    NaN         NaN
914            44.0      F          other    08105     NaN    NaN         NaN
572            51.0      M       educator    20003     NaN    NaN         NaN
267            23.0      M       engineer    83716     NaN    NaN         NaN
290            40.0      M       engineer    93550     NaN    NaN         NaN
348            24.0      F        student    45660     NaN    NaN         NaN
467            29.0      M       engineer    91201     NaN    NaN         NaN
2              53.0      F          other    94043     NaN    NaN         NaN
702            37.0      M          other    89104     NaN    NaN         NaN
71              NaN    NaN            NaN      NaN    39.0      M   scientist
636             NaN    NaN            NaN      NaN    47.0      M    educator
363             NaN    NaN            NaN      NaN    20.0      M     student
203             NaN    NaN            NaN      NaN    25.0      F     student
17              NaN    NaN            NaN      NaN    30.0      M  programmer
723             NaN    NaN            NaN      NaN    26.0      M   executive
259             NaN    NaN            NaN      NaN    21.0      M     student
366             NaN    NaN            NaN      NaN    20.0      F     student
887             NaN    NaN            NaN      NaN    14.0      F     student


        zip_code
user_id
716          NaN
914          NaN
572          NaN
267          NaN
290          NaN
348          NaN
467          NaN
2            NaN
702          NaN
71         98034
636        48043
363        87501
203        32301
17         06355
723        94403
259        48823
366        50670
887        27249

![sql joins](https://upload.wikimedia.org/wikipedia/commons/9/9d/SQL_Joins.svg)

### Merge

[Merge()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html) is most useful when you want to merge rows that share data.

In [528]:
import numpy as np
import pandas as pd   
from IPython.display import display_html

In [574]:
df1 = pd.DataFrame(
    {
        "key1": ["K0", "K0", "K1", "K2"],
        "key2": ["K0", "K1", "K0", "K1"],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
    }
)


df2 = pd.DataFrame(
    {
        "key1": ["K0", "K1", "K1", "K2"],
        "key2": ["K0", "K0", "K0", "K0"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    }
)

df3 = pd.DataFrame(
    {
        "key1": ["K90", "K1", "K1", "K2"],
        "key2": ["K0", "K0", "K5", "K0"],
        "C": ["C0", "C1", "C2", "C3"],
        "Y": ["D0", "D70", "D2", "D5"],
    }
)

In [575]:
df1_styler = df1.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2.style.set_table_attributes("style='display:inline'").set_caption('Right table')
display_html(df1_styler._repr_html_()+ df2_styler._repr_html_(), raw=True)

,key1,key2,A,B
0,K0,K0,A0,B0
1,K0,K1,A1,B1
2,K1,K0,A2,B2
3,K2,K1,A3,B3
,key1,key2,C,D
0,K0,K0,C0,D0
1,K1,K0,C1,D1
2,K1,K0,C2,D2
3,K2,K0,C3,D3

In [576]:
# merge, default is inner

result = pd.merge(df1, df2)
result

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [577]:
result_on = pd.merge(df1, df2, on=["key1", "key2"])
result_on

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

#### LEFT Merge

In [613]:
left_merge = pd.merge(df1, df2, how="left")


df1_styler = df1.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2.style.set_table_attributes("style='display:inline'").set_caption('Right table')
left_merge = left_merge.style.set_table_attributes("style='display:inline'").set_caption("left_merge")

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_() + left_merge._repr_html_(), raw=True)

#### RIGHT Merge

In [612]:
right_merge = pd.merge(df1, df2, how="right")


df1_styler = df1.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2.style.set_table_attributes("style='display:inline'").set_caption('Right table')
right_merge = right_merge.style.set_table_attributes("style='display:inline'").set_caption("right_merge")

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_() + right_merge._repr_html_(), raw=True)

#### INNER Merge

In [614]:
inner_merge = pd.merge(df1, df2, how="inner")


df1_styler = df1.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2.style.set_table_attributes("style='display:inline'").set_caption('Right table')
inner_merge = inner_merge.style.set_table_attributes("style='display:inline'").set_caption("inner_merge")

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_() + inner_merge._repr_html_(), raw=True)

#### OUTER Merge

In [615]:
outer_merge = pd.merge(df1, df2, how="outer")

df1_styler = df1.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2.style.set_table_attributes("style='display:inline'").set_caption('Right table')
outer_merge = outer_merge.style.set_table_attributes("style='display:inline'").set_caption("outer_merge")

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_() + outer_merge._repr_html_(), raw=True)

In [590]:
#Q:  Merging on an already merged table: merging more than 1 df

result_on_itself = pd.merge(result_on, df3, how="left") #, suffixes=["a", "_right"]
result_on_itself

  key1 key2   A   B   C   D    Y
0   K0   K0  A0  B0  C0  D0  NaN
1   K1   K0  A2  B2  C1  D1  D70
2   K1   K0  A2  B2  C2  D2  NaN

### Merging / Concatenating in two different columns

In [628]:
df1_docs = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [1, 2, 3, 5]})
df2_docs = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [5, 6, 7, 8]})

In [630]:
df1_styler = df1_docs.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2_docs.style.set_table_attributes("style='display:inline'").set_caption('Right table')

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_(), raw=True)

,lkey,value
0,foo,1
1,bar,2
2,baz,3
3,foo,5
,rkey,value
0,foo,5
1,bar,6
2,baz,7
3,foo,8

#### Concatenating in two different columns

In [633]:
concat_docs = pd.concat([df1_docs, df2_docs], axis=1, keys=["1st table", "2nd table"])

df1_styler = df1_docs.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2_docs.style.set_table_attributes("style='display:inline'").set_caption('Right table')
merge_styler = concat_docs.style.set_table_attributes("style='display:inline'").set_caption('concat_docs')

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_() + merge_styler._repr_html_(), raw=True)

#### Merging in two different columns

In [641]:
df1_styler = df1_docs.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2_docs.style.set_table_attributes("style='display:inline'").set_caption('Right table')

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_(), raw=True)

,lkey,value
0,foo,1
1,bar,2
2,baz,3
3,foo,5
,rkey,value
0,foo,5
1,bar,6
2,baz,7
3,foo,8

In [646]:
merge_docs = df1_docs.merge(df2_docs, left_on='lkey', right_on='rkey', suffixes = ["_fromleft", "_fromright"])

In [650]:
merge_docs = df1_docs.merge(df2_docs, left_on='lkey', right_on='rkey', suffixes = ["_from_left", "_from_right"])


df1_styler = df1_docs.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2_docs.style.set_table_attributes("style='display:inline'").set_caption('Right table')
merge_styler = merge_docs.style.set_table_attributes("style='display:inline'").set_caption('merge_docs')

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_() + merge_styler._repr_html_(), raw=True)

In [ ]:
# suffixes: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html

In [ ]:
# concat: putting things together
# join/merge: putting things together THAT ARE RELATED
    # related info in the same place -> reduces redundancy

### Join
The join, unlike the merge, will join the dataframes and where there are no records in the "index" it will put NaN

In [651]:
import numpy as np
import pandas as pd   
from IPython.display import display_html

In [652]:
left_df = pd.DataFrame(
    {"A": ["A0", "A1", "A2"], "B": ["B0", "B1", "B2"]}, index=["K0", "K1", "K2"]
)


right_df = pd.DataFrame(
    {"C": ["C0", "C2", "C3"], "D": ["D0", "D2", "D3"]}, index=["K0", "K2", "K3"]
)

In [644]:
df1_styler = left_df.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = right_df.style.set_table_attributes("style='display:inline'").set_caption('Right table')

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_(), raw=True)

,A,B
K0,A0,B0
K1,A1,B1
K2,A2,B2
,C,D
K0,C0,D0
K2,C2,D2
K3,C3,D3

In [653]:
result = left_df.join(right_df, how="inner")

#Rendering the df's in the same line. No need to learn this code

df1_styler = left_df.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = right_df.style.set_table_attributes("style='display:inline'").set_caption('Right table')
df1_df2_merged = result.style.set_table_attributes("style='display:inline'").set_caption('JOIN')

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_() + df1_df2_merged._repr_html_(), raw=True)
#display_html(df1_styler._repr_html_()+ df2_styler._repr_html_(), raw=True)

### Differences between join & merge

<figure class="wp-block-table is-style-stripes"><table class="has-fixed-layout"><thead><tr><th><strong>Join Feature</strong></th><th class="has-text-align-center" data-align="center"><strong>join()</strong></th><th class="has-text-align-center" data-align="center"><strong>merge()</strong></th></tr></thead><tbody><tr><td>inner</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>left</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>right</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>outer</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>cross</td><td class="has-text-align-center" data-align="center">X</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>Join on Indices</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>Join on Columns</td><td class="has-text-align-center" data-align="center">X</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>Left on column, right on index</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>Left on index, right on column</td><td class="has-text-align-center" data-align="center">X</td><td class="has-text-align-center" data-align="center">Yes</td></tr></tbody></table><figcaption>pandas join vs merge</figcaption></figure>

## Export data

In [ ]:
df.to_csv("../datasets/exported_example.csv")

## Pandas usual methods
```python
df.head() # prints the head, default 5 rows
df.tail() # set the tail, default 5 rows
df.describe() # statistical description
df.info() # df information
df.info(memory_usage='deep')
df.columns # show column
df.index # show index
df.dtypes # show column data types
df.plot() # make a plot
df.hist() # make a histogram
df.col.value_counts() # counts the unique values ​​of a column
df.col.unique() # returns unique values ​​from a column
df.copy() # copies the df
df.drop() # remove columns or rows (axis=0,1)
df.dropna() # remove nulls
df.fillna() # fills nulls
df.shape # dimensions of the df
df._get_numeric_data() # select numeric columns
df.rename() # rename columns
df.str.replace() # replace columns of strings
df.astype(dtype='float32') # change the data type
df.iloc[] # locate by index
df.loc[] # locate by element
df.transpose() # transposes the df
df.T
df.sample(n, frac) # sample from df
df.col.sum() # sum of a column
df.col.max() # maximum of a column
df.col.min() # minimum of one column
df[col] # select column
df.col
df.isnull() # null values
df.isna()
df.notna() # not null values
df.drop_duplicates() # remove duplicates
df.reset_index(inplace=True) # reset the index and overwrite
```

## Mega-recap
It's your turn, what have we learned today?

## Further materials

* [Read the docs!](https://pandas.pydata.org/pandas-docs/stable/index.html)
* [Cheatsheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
* [Exercises to practice](https://github.com/guipsamora/pandas_exercises)
* [More on merge, concat, and join](https://realpython.com/pandas-merge-join-and-concat/#pandas-join-combining-data-on-a-column-or-index). And [even more!](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)